Repository: Kwaain/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/contributing.po
Languages: es_ve

source: How to contribute
es_ve: Cómo contribuir

source: First of all, thanks for taking your time to contribute!
es_ve: Primero que nada, gracias por tomarse su tiempo para contribuir!

source: Please note that only questions on the framework will be answered here. For issue related with any module, please contact their respective authors or post in their corresponding repositories.
es_ve: Tenga en cuenta que sólo las preguntas del framework serán contestadas aquí. Para problemas relacionados con los canales, favor ponerse en contacto con los autores respectivos o publicar en los repositorios correspondientes.

source: Here is a simple guide on how you can file in an issue, or submit a pull request that is useful and effective.
es_ve: Aquí está una guía sencilla sobre cómo puede presentar un problema, o enviar un pull request que es útil y efectiva.

source: If you need help, or want to talk to the authors, feel free to chat with us at our `Gitter chat`_ or `Telegram support group`_.
es_ve: Si necesita ayuda o desea hablar con los autores, puede chatear con nosotros en nuestro `Gitter chat`_ o `Telegram support group`_.

source: Reporting bugs
es_ve: Informe de errores

source: Before submitting a bug report
es_ve: Antes de enviar un informe de error

source: Please ensure if your issue is about the framework itself, not about any module. Reports about module should be sent to their respective places.
es_ve: Asegúrese de que el problema sea sobre el framework mismo, no sobre cualquier módulo. Los informes sobre los canales deberían ir en sus respectivos canales.

source: Read through the documentation to see if it has covered your question.
es_ve: Lea la documentación para ver si se ha cubierto su pregunta.

source: Check the `current issue list`__ to see if it's been reported.
es_ve: Verifique la `current issue list`__ para ver si ya se ha informado.

source: How Do I Submit A (Good) Bug Report?
es_ve: ¿Cómo puedo enviar un (buen) Informe de Error?

source: **Use a clear and descriptive title** for the issue to identify the problem.
es_ve: **Use un título claro y descriptivo** para el problema para identificar el error.

source: **Describe the exact steps which reproduce the problem** in as many details as possible.
es_ve: **Describa los pasos exactos que producen el problema** en tantos detalles como sea posible.

source: **Provide specific examples to demonstrate the steps.**
es_ve: **Proporcione ejemplos concretos para demostrar los pasos.**

source: **Describe the behavior you observed after following the steps** and point out what exactly is the problem with that behavior.
es_ve: **Describa el comportamiento observado después de seguir los pasos** y señale cuál es exactamente el problema con ese comportamiento.

source: **Explain which behavior you expected to see instead and why.**
es_ve: **Explique qué comportamiento esperaba ver y por qué.**

source: **If the problem wasn't triggered by a specific action**, describe what you were doing before the problem happened and share more information using the guidelines below.
es_ve: **Si el problema no fue provocado por una acción específica**, describa lo que estaba haciendo antes de que ocurriera el problema y comparta más información usando las pautas a continuación.

source: **Provide log related to the issue.** Use the verbose flag to start the logging process, and submit the entire log from the first step you performed.
es_ve: **Proporcione un registro relacionado con el problema.** Use el indicador detallado para iniciar el proceso de registro y envíe el registro complpeto desde el primer paso que realizó.

source: Provide more context by answering these questions:
es_ve: Proporcione más contexto respondiendo las siguientes preguntas:

source: **Did the problem start happening recently** (e.g. after updating to the latest version) or was this always a problem?
es_ve: **¿El problema comenzó a suceder recientemente?** (por ejemplo, después de actualizar a la última versión) o siempre fue un problema?

source: **Can you reliably reproduce the issue?** If not, provide details about how often the problem happens and under which conditions it normally happens.
es_ve: **¿Puede reproducir el problema de manera confiable?** Sino, proporcione detalles acerca de la frecuencia con la que ocurre el problema y bajo qué condiciones ocurre normalmente.

source: Include details about your configuration and environment:
es_ve: Incluya detalles sobre su configuración y entorno:

source: **What version of EFB are you using?** You can get the version by using the flag `-V`.
es_ve: **¿Qué versión de EFB está usando?** puede obtener la versión utilizando el indicador `-V`.

source: **What's the name and version of the OS you're using?**
es_ve: **¿Cuál es el nombre y la versión del sistema operativo que está usando?**

source: When submitting your log, please remember to hide your private information.
es_ve: Al enviar su registro, recuerde ocultar su información privada.

source: Suggesting enhancements
es_ve: Sugiriendo mejoras

source: If you have any suggestions, feel free to raise it up in the issue list. Please try to provide as much details as you can, that includes:
es_ve: Si tiene alguna sugerencia, no dude en presentarla en la lista de problemas. Por favor intente proporcionar tanta información como sea posible, que incluye:

source: **Use a clear and descriptive title** for the issue to identify the suggestion.
es_ve: **Utilice un título claro y descriptivo** para identificar la sugerencia.

source: **Give details on how the enhancement behave**.
es_ve: **Proporcione detalles sobre cómo se comporta la mejora **.

source: Adapted from `Atom contribution guide`__ by GitHub Inc.
es_ve: Adaptado de `Atom contribution guide`__ por GitHub Inc.

source: Pull requests
es_ve: Solicitudes de extracción

source: When you have done some changes and want to submit it to us, fork it to your account and submit a GitHub pull request. Please write a detailed description for your pull request on:
es_ve: Cuando haya realizado algunos cambios y desee enviárnolos a nosotros, bifurque en su cuenta y envíe una solicitud de extracción de GitHub. Por favor escriba una descripción detallada de su solicitud de extracción en:

source: **What changes have you made?**
es_ve: **¿Qué cambios ha realizado?**

source: **What problem have you solved?**
es_ve: **¿Qué problemas ha resuelto?**

source: **Which issue have you addressed** if applicable.
es_ve: **¿Qué problema ha tratado?** si corresponde.

source: Always write a clear log message for your commits. One-line messages are fine for small changes, but bigger changes needs a detailed description after the one-liner.
es_ve: Escriba siempre un mensaje claro para sus commits. Los mensajes de una línea están bien para cambios pequeños, pero los cambios más grandes necesitan una descripción detallada de más de una línea.

source: Adapted from `OpenGovernment contribution guide`__ by Participatory Politics Foundation
es_ve: Adaptado de `OpenGovernment contribution guide`__ por la Fundación de Política Participativa
