Repository: Kwaain/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/start.po
Languages: es_ve, zh_cn

source: Launch the framework
es_ve: Iniciar el Framework
zh_cn: 启动框架

source: EH Forwarder Bot offered 2 ways to launch the framework:
es_ve: EH Forwarder Bot ofreció 2 formas de iniciar el Framework:
zh_cn: EFB 提供了两种方法来启动框架：

source: Both commands are exactly the same thing, accept the same flags, run the same code. The latter is only a backup in case the former does not work.
es_ve: Ambos comandos son exactamente lo mismo, acepta los mismos indicadores, ejecuta el mismo código. Este último es solo una copia de seguridad en caso de que el primero no funcione.
zh_cn: 两个命令的功能及用法完全一致，运行相同的代码。后者只是一个备份，以防前者不起作用。

source: Options
es_ve: Opciones
zh_cn: 选项

source: ``-h``, ``--help``: Show help message
es_ve: ``-h``, ``--help``: Muestra el mensaje de ayuda
zh_cn: ``-h``, ``--help``：显示帮助信息

source: :samp:`-p {PROFILE}`, :samp:`--profile {PROFILE}`: Switch :doc:`profile <profile>`
zh_cn: :samp:`-p {PROFILE}`, :samp:`--profile {PROFILE}`: 切换\ :doc:`配置档案 <profile>`

source: From version 2, EFB supports running different instances under the same user, identified by their profiles. The default profile is named ``default``.
es_ve: A partir de la versión 2, EFB admite ejecutar diferentes instancias bajo el mismo usuario, identificadas por sus perfiles. El perfil predeterminado se llama `` default``.
zh_cn: 从 2.0 版本开始，EFB 支持在同一用户下运行多个实例（根据配置档案进行区分）。默认的配置档案名称为 ``default`` 。

source: ``-V``, ``--version``: Print version information
es_ve: `-V``,` `--version``: Imprimir información de versión
zh_cn: ``-V``, ``--version``: 打印版本信息

source: This shows version number of Python you are using, the EFB framework, and all channels and middlewares enabled.
es_ve: Esto muestra el número de versión de Python que está utilizando, el marco EFB y todos los canales y middleware habilitados.
zh_cn: 显示您的 Python、EFB 框架、以及所有已启用的信道和中间件的版本号。

source: ``-v``, ``--verbose``: Print verbose log
es_ve: `` -v``, `` --verbose``: Imprimir registro detallado
zh_cn: ``-v``, ``--verbose``: 打印详细日志

source: This option enables verbose log of EFB and all enabled modules. This, together with ``--version``, is particularly useful in debugging and issue reporting.
zh_cn: 开启该选项会记录 EFB 及所有已启用的模块的详细日志。该选项和 ``--version`` 一同，对于调试及问题反馈有着极大帮助。

source: ``--trace-threads``: Trace hanging threads
zh_cn: ``--trace-threads``：跟踪阻塞线程

source: This option is useful to identify source of the issue when you encounter situations where you had to force quit EFB. When this option is enabled, once the first stop signal (``SIGINT`` or ``SIGTERM``) is sent, threads that are *asleep* will be identified and reported every 10 seconds, until a second stop signal is seen.
zh_cn: 当您遇到必须强制退出 EFB 的情况时，此选项可用于确定问题的来源。启用此选项后，在发送第一个停止信号（``SIGINT`` 或 ``SIGTERM``）之后，将会每 10 秒识别一次\ *休眠*\ 中的线程，直到收到下一个停止信号。

source: In order to use this option, you need to install extra Python dependencies using the following command.
zh_cn: 要使用此选项，您需要使用以下命令来安装额外的 Python 依赖关系。

source: Quitting EFB
zh_cn: 退出 EFB

source: If you started EFB in a shell, you can simply press :kbd:`Control-c` to trigger the quit process. Otherwise, ask your service manager to issue a ``SIGTERM`` for a graceful exit. The exit process may take a few second to complete.
zh_cn: 如果您在 shell 中启动了 EFB， 您可以简单地通过 :kbd:`Control-c` 来触发退出流程。否则，请使用您的服务管理器发送 ``SIGTERM`` 信号。完全退出进程可能会耗时数秒种。

source: It is important for you to issue a graceful termination signal (e.g. ``SIGTERM``), and **NOT** to use ``SIGKILL``. Otherwise you may face the risk of losing data and breaking programs.
zh_cn: 使用优雅终止信号（例如 ``SIGTERM``\ ）十分重要。请\ **不要**\ 使用 ``SIGKILL``，否则可能会导致数据丢失或程序异常。

source: If you have encountered any issue quitting EFB, press :kbd:`Control-c` for 5 times consecutively to trigger a force quit. In case you have frequently encountered situations where you had to force quit EFB, there might be a bug with EFB or any modules enabled. You may want to use the ``--trace-threads`` option described above to identify the source of issue, and report this to relevant developers.
zh_cn: 如果您在退出 EFB 时遇到任何问题，请连按五次 :kbd:`Control-c` 触发强制退出。如果您经常遇到必须强制退出 EFB 的情况，则表明 EFB 或任何使用中的组件可能正在发生故障。您可能需要使用上文中的 ``--trace-threads`` 选项来确定问题的根源，并向相关开发者报告。

source: This option enables verbose log of EFB and all enabled modules. This, together with ``-V``, is particularly useful in debugging and issue reporting.
es_ve: Esta opción habilita el registro detallado de EFB y todos los módulos habilitados. Esto, junto con `` -V``, es particularmente útil en la depuración y el informe de problemas.
