Repository: Kwaain/ehForwarderBot
Catalog: docs/locale/*/LC_MESSAGES/API/exceptions.po
Languages: es_ve

source: Exceptions
es_ve: Excepciones

source: A general class to indicate that the exception is from EFB framework.
es_ve: Una clase general para indicar que la excepción proviene del framework EFB.

source: Raised by a slave channel when a chat indicated is not found.
es_ve: Llamada por el canal esclavo cuando el chat indicado no ha sido encontrado.

source: Can be raised by any method that involves a chat or a message.
es_ve: Puede ser llamada por cualquier método que involucre un chat o un mensaje.

source: Raised by the coordinator when the message sent delivers to a missing channel.
es_ve: Excepción llamada por el coordinador cuando el mensaje es enviado a un canal no encontrado.

source: Raised by slave channel for any other error occurred when sending a message or a status.
es_ve: Excepción llamada por el canal esclavo al ocurrir cualquier otro error al enviar un mensaje o un estado.

source: Can be raised in :meth:`.Channel.send_message` and :meth:`.Channel.send_status`.
es_ve: Puede ser llamada en :meth:`.Channel.send_message` y :meth:`.Channel.send_status`.

source: Raised by a slave channel when a message indicated is not found.
es_ve: Excepción llamada por un canal esclavo cuando no se encuentra el mensaje indicado.

source: Can be raised in :meth:`.Channel.send_message` (edited message / target message not found) and in :meth:`.Channel.send_status` (message to delete is not found).
es_ve: Puede ser llamada en :meth:`.Channel.send_message` (mensajes editados / mensaje destino no encontrado) y en :meth:`.Channel.send_status` (el mensaje ha eliminar no ha sido encontrado).

source: Raised by a slave channel when the indicated message type is not supported.
es_ve: Excepción llamada por el canal esclavo cuando el tipo de mensaje seleccionado no es soportado.

source: Can be raised in :meth:`.Channel.send_message`.
es_ve: Puede ser llamada en :meth:`.Channel.send_message`.

source: Raised by slave channels when a chat operation is not supported. E.g.: cannot edit message, cannot delete message.
es_ve: Excepción llamada en los canales esclavos cuando se realiza una operación en el chat que no es soportada. Ejemplo: no se pueden editar los mensajes, no se pueden eliminar los mensajes.
